package day09_task;

public class MethodTask {
   public static void main(String[] args) {
      // 1. 음수를 양수로, 양수를 음수로 바꿔주는 메소드
      // 매개변수 o, 리턴값 o
      // 메소드명 : changeSign
	   

      // 2. 이름과 정수를 받아와서 정수만큼 이름을 출력하는 메소드
      // 매개변수 o, 리턴값 o
      // 메소드명 : printName

      // 3. 10이하의 숫자는 1로 10을 초과하는 숫자는 100으로 반환하는 메소드
      // 매개변수 o, 리턴값 o
      // 메소드명 : changeNumber
	   
	   
                  
	   
	   
	   
	   

      // 4. 5개의 정수 중 평균을 반환하는 메소드
      // 매개변수 o(배열), 리턴값 o
      // 메소드명 : getAvg

      // 5. 정수 배열 중 최대값과 최소값을 출력하는 메소드
      // 매개변수 o(배열), 리턴값 x
      // 메소드명 : printMinMax

      // 6. 소문자는 대문자로, 대문자는 소문자로 바꿔주는 메소드
      // 예시) BanaNA -> bANAna
      // 메소드명 : changeCase
      // 매개변수와 반환값은 자유 => 단, 형 변환 이용할 것!!

      // 7. 아이디와 비밀번호를 입력받아 로그인 하기
      // 매개변수 o 리턴값 o(단, 리턴타입 boolean)
      // 메소드명 : login
      // main메소드에서 id가 admin이고 비밀번호가 1234이면 관리자님 환영합니다 출력
      // id가 test 이고 비밀번호가 abcd이면 일반 회원님 환영합니다 출력
      // id와 비밀번호 둘 중 하나라도 틀리면 다시 확인하세요 출력

   }
}
