package test1;

public class Test01 { // 클래스 시작 중괄호 영역
	public static void main(String[] args) { // 메인 메소드 시작 중괄호 영역
		// 프로그램 실행 방향 : 위에서 아래로, 왼쪽에서 오른쪽으로
		System.out.println("윤철민"); // 윤철민이라는 문자열을 콘솔창에 출력하고 줄바꿈한다
		System.out.println("2025년 12월 31일 3일차수업");
		// 2025년 12월 31일 3일차수업이라는 문자열을 콘솔창에 출력하고 줄바꿈한다

		System.out.print("윤철민"); // 윤철민이라는 문자열을 콘솔창에 출력하고 줄바꿈 하지 않는다
		System.out.print("2025년 12월 31일 3일차수업");
		// 2025년 12월 31일 3일차수업이라는 문자열을 콘솔창에 출력하고 줄바꿈 하지 않는다
	
	} // 메인 메소드 끝 중괄호 영역
} // 클래스 끝 중괄호 영역
