package basicTask01;

public class SingTask01 {
	public static void main(String[] args) {
//		한 곡당 300원인 코인 노래방이다.
//		사용자로부터 금액을 입력받아 부를 수 있는 곡 수와 잔돈을 출력하는 프로그램 작성하기
//		[입력 예시]
//		금액입력 : 1000
//
//		[출력 예시]
//		3곡을 부를 수 있으며 잔돈은 100원입니다

		//사용할 문법
		// 입력 클래스 import, 정수형 변수 3개, 정수형 상수 1개, 산술연산자(/ %), 
		//출력메소드(printf), 입력메소드(sc.nextLine())-정수형형변환필요
		
		//1) 입력 클래스 import
		//2) 정수형 변수 3개(금액, 곡수, 잔돈) 선언, 정수형 상수 1개(한곡가격) 선언 초기화
		//3) 출력 메시지
		//4) 입력 메소드(nextLine), Integer.parseInt(sc.nextLine()), 금액 변수에 대입
		//5) 곡수 변수에 금액 / 상수 대입
		//6) 잔돈 변수에 금액 % 상수 대입
		//7) 출력
		
		
		
	}
}
























