package basicTask01;

public class SingTask02 {
	public static void main(String[] args) {
		
/*문제2 : 한 곡당 300원인 코인 노래방이다.
	     문제1를 확장하여 한 곡당 가격도 사용자에게 입력받아 부를 수 있는 곡 수와 잔돈을 출력하는 프로그램 작성하기
		
		[입력 예시]
		금액입력 : 1000
		곡 당 가격 입력 : 300

		[출력 예시]
		3곡을 부를 수 있으며 잔돈은 100원입니다 */	
		
/*  	 [사용할 문법]  // add : 빼먹은 내용인데 코드 작성하면서 추가한 내용
	 	 입력 스캐너 import, next(), 출력 메소드
	     문자열  정수형 변수선언, 나눗셈 연산, 스캐너 해제, 곡 당 가격 입력 : 출력 메소드 추가, 입력 메소드 추가
	 	 add : 나머지 연산 % 
	 																		*/		
		
		
		
		
		
		
		
	}
}


