package basicTask01;

public class SingTask04 {
	public static void main(String[] args) {
/*문제4 : 한 곡당 가격은 200원, 음료 가격은 100원이다.
		사용자로부터 금액을 입력받아 음료를 구매하지 않을 경우 부를 수 있는 곡 수와 잔돈 출력하기
		음료를 구매할 경우 부를 수 있는 곡 수와 잔돈 출력하기
	
		[입력 예시]
		금액입력 : 1000

		[출력 예시]
		5곡을 부를 수 있으며 잔돈은 0원입니다
		음료를 마시고 싶으면 4곡을 부를 수 있으며 잔돈은 100원입니다 */	
	
/*		[사용할 문법]  // add : 빼먹은 내용인데 코드 작성하면서 추가한 내용
		입력 스캐너 import, next(), 출력 메소드
		문자열  정수형 변수선언, 나눗셈 연산, 스캐너 해제, 곡 당 가격 입력 : 출력 메소드 추가, 입력 메소드 추가
		add : 나머지 연산 % 											*/			
	
	
	
	
	
	
	
	
	}
}
