package basicTask01;

public class SingTask03 {
	public static void main(String[] args) {
			
/*문제3 : 문제 2를 확장하여 입력한 금액이 곡 당 가격보다 부족한 경우
		노래를 부를 수 없다는 안내 문구를 출력하는 프로그램 작성하기
		
		[입력 예시]
		금액입력 : 100
		곡 당 가격 입력 : 300

		[출력 예시]
		입력한 금액은 100원입니다.
		곡 당 가격은 300원으로 200원이 부족하여 노래를 부를 수 없습니다*/	
	
/*  	 [사용할 문법]  // add : 빼먹은 내용인데 코드 작성하면서 추가한 내용
 	 입력 스캐너 import, next(), 출력 메소드
     문자열  정수형 변수선언, 나눗셈 연산, 스캐너 해제, 곡 당 가격 입력 : 출력 메소드 추가, 입력 메소드 추가
 	 add : 나머지 연산 % 
 	
 																		*
 																		*/	
		
		
		
	}
}
